## Content

- **Transpose of a dataframe**

- **Conversion between numpy array and dataframe**

- **Shift Operation**

In [1]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

## Transpose of dataframe

  - Change rows to cols and vice-versa
  - It can be done in a similar way as that of numpy

Syntax: `df.T`

In [2]:
df = pd.DataFrame({"A": [1, 10, 100],
                   "B": [2, 20, 200]
                   })
df

     A    B
0    1    2
1   10   20
2  100  200

In [3]:
df.T

   0   1    2
A  1  10  100
B  2  20  200

***


## Converting b/w Numpy Arrays and Pandas DataFrames


Let's **create a numpy matrix first**

#### Remember what` randint()` does?

- Generate random integers b/w provided range

In [4]:
arr = np.random.randint(10, 100, size=(6,4))
arr

array([[93, 80, 45, 44],
       [40, 57, 67, 60],
       [96, 92, 35, 88],
       [93, 73, 96, 93],
       [20, 37, 27, 24],
       [19, 93, 39, 12]])

- We got a $6\times4$ **numpy matrix**


#### Now, To convert it to a pandas DataFrame

- All we have to do is **use `pd.DataFrame()`**

In [5]:
df = pd.DataFrame(data=arr)
df

    0   1   2   3
0  93  80  45  44
1  40  57  67  60
2  96  92  35  88
3  93  73  96  93
4  20  37  27  24
5  19  93  39  12

- It has **created a DataFrame with 6 rows and 4 columns**

#### Now, Let's see how we can convert a pandas DataFrame to numpy array

- We'll use the created DataFrame `df`


- We'll convert this DataFrame back to a numpy array


- All we have to do is **use `df.values`**

In [6]:
df.values

array([[93, 80, 45, 44],
       [40, 57, 67, 60],
       [96, 92, 35, 88],
       [93, 73, 96, 93],
       [20, 37, 27, 24],
       [19, 93, 39, 12]])

#### So, very quickly we can convert b/w Numpy arrays and Pandas DataFrames

#### Be cautious though!

- This **works only on numerical values**


- As you know, **numpy CANNOT handle string values**

#### What if we try to convert a DataFrame having string values to Numpy array?

In [7]:
df[0][0] = 'abc'
df

     0   1   2   3
0  abc  80  45  44
1   40  57  67  60
2   96  92  35  88
3   93  73  96  93
4   20  37  27  24
5   19  93  39  12

In [8]:
df.values

array([['abc', 80, 45, 44],
       [40, 57, 67, 60],
       [96, 92, 35, 88],
       [93, 73, 96, 93],
       [20, 37, 27, 24],
       [19, 93, 39, 12]], dtype=object)

#### Can you tell what happened here?

- When `df.values` encountered a string value


- It **converted all values to type `object`** (string)


#### So, be careful while doing conversions b/w Numpy Arrays and Pandas DataFrames

***

In [10]:
np.array(df.values)

array([['Sidhu', 100],
       ['Moose', 95],
       ['Jubin', 80],
       ['Arijit', 96],
       ['KK', 99]], dtype=object)

## Shift Operation

How do we shift the values of rows or columns up and fill them efficiently?

#### Row Shift

In [25]:
df = pd.DataFrame({"Name" : ["Sidhu", "Moose", "Jubin", "Arijit", "KK"], 
                   "Marks" : [100, 95, 80, 96, 99]})
df.head()

     Name  Marks
0   Sidhu    100
1   Moose     95
2   Jubin     80
3  Arijit     96
4      KK     99

Now we realize that the marks are to be shifted, that is Moose should get 100, Jubin 95, and so on. How do we do this efficiently?

In [26]:
df["Marks"] = df["Marks"].shift(periods = 1, axis = 0,  fill_value = 1)
df

     Name  Marks
0   Sidhu      1
1   Moose    100
2   Jubin     95
3  Arijit     80
4      KK     96

The shift function has parameters which consist of "periods" -> number of periods to shift, "axis" -> 0 for row shifting and 1 for column.

We can make use of it to efficiently shift and then we can add new value to Sidhu's marks.

In [22]:
df["Marks"][0] = 99
df

     Name  Marks
0   Sidhu   99.0
1   Moose  100.0
2   Jubin   95.0
3  Arijit   80.0
4      KK   96.0

#### Column shift

Suppose we fill roll numbers with names and names with marks and now want to shift it.

Also roll numbers are not yet know, so fill all as 1.

In [23]:
df = pd.DataFrame({"Roll No" : ["Sidhu", "Moose", "Jubin", "Arijit", "KK"],
                   "Name" :[100, 95, 80, 96, 99], 
                   "Marks" : ['', '', '', '', '']})
df.head()

  Roll No  Name Marks
0   Sidhu   100
1   Moose    95
2   Jubin    80
3  Arijit    96
4      KK    99

In [24]:
df = df.shift(periods = 1, axis = 1, fill_value = 1)
df

   Roll No    Name  Marks
0        1   Sidhu    100
1        1   Moose     95
2        1   Jubin     80
3        1  Arijit     96
4        1      KK     99

Changing roll numbers

In [27]:
df["Roll No"] = df.index

In [28]:
df

     Name  Marks  Roll No
0   Sidhu      1        0
1   Moose    100        1
2   Jubin     95        2
3  Arijit     80        3
4      KK     96        4

Refer to the documentation for more : https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.shift.html